Tekla.Structures.Model.History.ModelHistory.GetModifiedObjects(System.String)
Gets a list of the objects that have been added or modified after the modification stamp.
ModStamp: The modification stamp, in string format. This may be Guid or encoded in case of static model ids.
Returns: A list of the objects that have been modified after the given modification stamp.

Tekla.Structures.Model.History.ModelHistory.GetDeletedObjects(System.String)
Gets a list of the objects that have been deleted after the modification stamp.
ModStamp: The modification stamp, as returned by GetCurrentModificationStampGuid().
Returns: A list of the objects that have been deleted after the given modification stamp.

Tekla.Structures.Model.History.ModelHistory.GetDeletedObjectsWithType(System.String,Tekla.Structures.Model.ModelObject.ModelObjectEnum)
Gets based on type a list of the objects that have been deleted after the modification stamp.
ModStamp: The modification stamp, as returned by GetCurrentModificationStampGuid().
Enum: The type of the objects to return.
Returns: A list of the objects that have been deleted after the given modification stamp.

Tekla.Structures.Model.History.ModelHistory.GetModifications(System.String,Tekla.Structures.Model.History.ModificationStamp)
Lookup modifications sine previous call of TakeModifications() without resetting the modstamp
Remarks: Takes modification which has happened to the model since the previous call to TakeModifications with the same Name argument.
If there was no previous call of TakeModifications() with this Name, shows modifications since beginning, or since PrevStap, if it is specified.
Name: Name of reference which is used for collecting modifications and which is updated.
Intended use is to assign an unique name for each client application which needs to be informed of the model updates.
Maximum length is 79 characters.
PrevStamp: When specified, default value of reference if is it not found
Returns: All modifications which happened since the last call